# Основное дз(из семинара):
# Создать информационную систему позволяющую работать с учениками школы
# функции
# Добавление нового студента (Поля - имя, фамилия)
# Добавление предмета (добавляется всем ученикам сразу)
# Добавление оценки ученику по предмету (выбираем ученика(из существующих), выбираем предмет(из сущ.),пишем оценку )
# Показ списка учеников (имена фамилия)
# Показ листа оценок конкретного ученика
# Выход из программы
# Достаточно хранить данные в переменной

import controller
controller.start()