# 44. Напишите программу, которая принимает на вход координаты двух точек и
#  находит расстояние между ними в 2D пространстве.
# Пример:
# A (3,6); B (2,1) -> 5,09
# A (7,-5); B (1,-1) -> 7,21

A = [int(input(f"Введите {i} координату точки А: ")) for i in "xy"]
B = [int(input(f"Введите {i} координату точки B: ")) for i in "xy"]
result = round(sum([(n[1] - n[0]) ** 2 for n in zip(A, B)]) ** 0.5, 2)
print(result)